max-bot-cf/InformationRegisters/бестДопустимыйОбъемОтклоненийПоПоказаниям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДопустимыйОбъемОтклоненийПоПоказаниям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/бестДопустимыйОбъемОтклоненийПоПоказаниям/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеДанных

Функция АктуальныеДанные(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанные());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);
		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		ДоступныеПараметры = "Организация, Район, Услуга, ТарифнаяЗона";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			Параметры[1],
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);
			
	КонецЕсли;	 	
		
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность";	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;	
		
	КонецЕсли;
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаАктуальныеДанные() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаСрезПоследних.Район КАК Район,
	|	ТаблицаСрезПоследних.Услуга КАК Услуга,
	|	ТаблицаСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаСрезПоследних.Объем КАК Объем
	|ИЗ
	|	РегистрСведений.бестДопустимыйОбъемОтклоненийПоПоказаниям.СрезПоследних КАК ТаблицаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
